backend/scripts/socketLoadTest.yml
config:
  target: 'ws://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: Warm up
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: Ramp up load
  defaults:
    headers:
      Authorization: Bearer {{ token }}

scenarios:
  - name: 'Galaxy view with real-time updates'
    engine: 'socketio'
    flow:
      - emit:
          channel: 'joinGalaxy'
          data:
            galaxy: 1
            system: 1
      - think: 10
      - emit:
          channel: 'requestGalaxyUpdate'
          data:
            galaxy: 1
            system: 1
      - think: 30